import numpy as np

# Проверочная матрица
H = np.array([
    [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
    [1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1],
    [0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0]
])

# Используем numpy для поиска решения уравнения H * x = 0
from sympy import Matrix
H_sympy = Matrix(H)
solution = H_sympy.nullspace()

# Получаем решение
codeword = np.array(solution[0]).flatten()  # Берем первое ненулевое решение

# Проверим, что оно действительно кодовое (H * x = 0)
# print("Ненулевое кодовое слово:", codeword)
# check = np.dot(H, codeword) % 2  # Проверим, что H * x = 0 по модулю 2
# print("Проверка, что оно кодовое (H * x % 2 = 0):", check)
# codeword=[0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]

codeword=[0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]


# codeword=[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

if np.sum(np.matmul(codeword, (H.T)) % 2) == 0:
    print("Ненулевое кодовое слово:", codeword)
else:
    print("Кодовое слово хуйня")

