import numpy as np

# # Проверочная матрица
# H = np.array([
#     [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
#     [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
#     [1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1],
#     [0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0]
# ])

# # Используем numpy для поиска решения уравнения H * x = 0
# from sympy import Matrix
# H_sympy = Matrix(H)
# solution = H_sympy.nullspace()

# # Получаем решение
# codeword = np.array(solution[0]).flatten()  # Берем первое ненулевое решение

# # Проверим, что оно действительно кодовое (H * x = 0)
# # print("Ненулевое кодовое слово:", codeword)
# # check = np.dot(H, codeword) % 2  # Проверим, что H * x = 0 по модулю 2
# # print("Проверка, что оно кодовое (H * x % 2 = 0):", check)
# # codeword=[0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]

# # codeword=[0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
#         #  [0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
#         #  [0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0]
#         #  [1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0]
# codeword=[1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0]
# # codeword=[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

# if np.sum(np.matmul(codeword, (H.T)) % 2) == 0:
#     print("Ненулевое кодовое слово:", codeword)
# else:
#     print("Кодовое слово хуйня")


from BCJR import BCJRDecoder 
from trellis_repo import get_trellis
from bpsk import bpsk_demodulation
from utils import read_csv
trellis1 = get_trellis('/home/i17m5/GLDPC/trellis_binaries/H_ham(16,11)')

# llr_in=[ 14.45278123,  16.21054051 ,  8.81886308  , 2.50358483 , 90.50822594,
#   15.78551759  , 9.61576327 ,-10.78005435  , 8.21385364,  10.07751358,
#  -14.92368358 ,-10.67865927, -60.92993565 , 10.86770752,  10.95095283,
#    9.97334605]
# llr_in = [  2.50358483, -10.67865927 ,  9.97334605 , 10.86770752 ,  8.81886308,
#   10.07751358, -10.78005435, -14.92368358 ,  9.61576327 , 10.95095283,
#   90.50822594  ,16.21054051 ,  8.21385364,  14.45278123  ,15.78551759,
#  -60.92993565]

llr_in=[ 10.07751358 ,  2.50358483,  90.50822594, -10.67865927, -10.78005435,
   9.97334605 ,  8.81886308 ,-60.92993565 ,-14.92368358 , 14.45278123,
  16.21054051 , 10.86770752  , 9.61576327 , 10.95095283  , 8.21385364,
  15.78551759]
H_cc = read_csv('/home/i17m5/GLDPC/matricies/H_ham(16,11).csv')

# llr_in = [154.98671912817557, -93.16231194779564, 67.44386492948027, -33.43374850245638, 75.05669730038835, 157.65607371994352, -33.43374850245638, -68.87386122877703, 68.873861228777031, 33.433748502456382, 1028.5131988413159, 75.05669730038835, -33.43374850245638, 67.44386492948027, 93.162311947795644, -559.6838895008139]
sigma2 =0.15848931924611134
codeword_candidat = bpsk_demodulation(llr_in)

print('codeword_candidat', codeword_candidat)

if np.sum(np.matmul(codeword_candidat, (H_cc.T)) % 2) == 0:
    print("Верное кодовое слово передано:", codeword_candidat)
else:
    print("В декодер передано не верное слово")


decoder = BCJRDecoder(trellis1.edg)
out_llr = decoder.decode(llr_in,sigma2)

codeword_candidat2 = bpsk_demodulation(out_llr)
if np.sum(np.matmul(codeword_candidat2, (H_cc.T)) % 2) == 0:
    print("Декодер докидировал верное кодовое слово своего кода:", codeword_candidat)
else:
    print("Декодер вернул неверное кодовое")




